app/Http/Controllers/KelasController.php

select * from `kelas`
---
    public function __construct()
    {
        parent::__construct();
        $this->kelas = new Kelas();
        $this->kelas_kategori = KelasKategori::get();