app/Http/Controllers/UserController.php

select * from `users` where `users`.`id` in (4)
---
    public function index()
    {
        $title = 'List Admin';
        $data_nav  = ['data-master', 'list-admin'];
        $users = $this->user->with('updated_name')->get();

select * from `users` where `users`.`id` = '5' limit 1
---
    public function edit($id)
    {
        $title = 'Edit Admin';
        $data_nav  = ['data-master', 'list-admin'];
        $user = $this->user->find($id);

select * from `users` where `users`.`id` = '5' limit 1
update `users` set `is_active` = '0', `users`.`updated_at` = '2024-11-15 10:17:49' where `id` = 5
---
    public function update(UserUpdateRequest $request, $id)
    {
        $data = $request->validated();
        if (!empty($data['password'])) {
            $password =  Hash::make($data['password']);
            $data['password'] = $password;
        } else {
            unset($data['password']);
        }
        $datas = array_merge($data, $this->userUpdate);
        $user = $this->user->findOrFail($id);
        $user->update($datas);